CFD-THM-coupling/mdot_transient/coupled/foam_cfd/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0. 0 2.);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 2.);
    }
    outlet
    {
        type            zeroGradient;
    }
    pipe
    {
        type            noSlip;
    }
}


// ************************************************************************* //
