CFD-THM-coupling/mdot_transient/coupled/foam_cfd/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    #calc "0.07*0.05";
        value           uniform 0.01;
    }
    outlet
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    pipe
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
}
