CFD-THM-coupling/mdot_transient/coupled/foam_cfd/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    pipe
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}
