CFD-THM-coupling/mdot_transient/coupled/foam_cfd/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       18;
    }
    thermodynamics
    {
        Cp              4186.0;
        Hf              0;
    }
    equationOfState
    { 
       rho              1000;
    }
    transport
    {
        mu              0.001;
        Pr              7;
    }
}
