CFD-THM-coupling/mdot_transient/coupled/foam_cfd/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     buoyantFoam;

solver          fluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.00005;

writeControl    runTime;

writeInterval   0.01;

adjustTimeStep     yes;

maxCo            2.;         // max Courant number

// purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   15;

runTimeModifiable true;

functions
{
    #includeFunc writeObjects(h, rho)
}
