CFD-THM-coupling/mdot_transient/coupled/foam_cfd/system/decomposeParDict
FoamFile {
    version 2.0;
    class dictionary;
    object decomposeParDict;
    format ascii;
}

numberOfSubdomains 8;

method          scotch;
